HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxXbar_regdef.h
/**
 * \file IfxXbar_regdef.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XA_TS_V3.0.1.R2
 * Specification: TC27xA_TS_V3.0.1_SFR_OPEN_MARKET.xml (Revision: V3.0.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Xbar Xbar
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Xbar_Bitfields Bitfields
 * \ingroup IfxLld_Xbar
 * 
 * \defgroup IfxLld_Xbar_union Union
 * \ingroup IfxLld_Xbar
 * 
 * \defgroup IfxLld_Xbar_struct Struct
 * \ingroup IfxLld_Xbar
 * 
 */
#ifndef IFXXBAR_REGDEF_H
#define IFXXBAR_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Xbar_Bitfields
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef struct _Ifx_XBAR_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID n (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID n (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID n (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID n (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID n (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID n (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID n (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID n (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID n (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID n (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID n (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID n (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID n (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID n (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID n (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID n (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID n (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID n (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID n (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID n (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID n (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID n (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID n (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID n (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID n (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID n (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID n (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID n (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID n (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID n (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID n (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID n (rw) */
} Ifx_XBAR_ACCEN0_Bits;

/** \\brief  Access Enable Register 1 */
typedef struct _Ifx_XBAR_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_XBAR_ACCEN1_Bits;

/** \\brief  Arbiter Control Register */
typedef struct _Ifx_XBAR_ARBCON_Bits
{
    unsigned int PRERREN:1;                 /**< \brief [0:0] SRI Protocol Error Enable (rw) */
    unsigned int SCERREN:1;                 /**< \brief [1:1] SRI Starvation Error Enable (rw) */
    unsigned int SETPRINT:1;                /**< \brief [2:2] Set SRI Protocol Interrupt (rwh) */
    unsigned int SETSCINT:1;                /**< \brief [3:3] Set SRI Starvation Interrupt (rwh) */
    unsigned int INTACK:1;                  /**< \brief [4:4] Interrupt Acknowledge (rwh) */
    unsigned int reserved_5:15;             /**< \brief \internal Reserved */
    unsigned int SPC:12;                    /**< \brief [31:20] Starvation Protection Counter Reload Value (rw) */
} Ifx_XBAR_ARBCON_Bits;

/** \\brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER0_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:19;              /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int reserved_21:11;            /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER0_DBADD_Bits;

/** \\brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER0_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:19;              /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int reserved_21:11;            /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER0_DBMADD_Bits;

/** \\brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER1_DBADD_Bits
{
    unsigned int reserved_0:27;             /**< \brief \internal Reserved */
    unsigned int ADDRESS_27:2;              /**< \brief [28:27] Debug Address Boundary (rw) */
    unsigned int reserved_29:3;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER1_DBADD_Bits;

/** \\brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER1_DBMADD_Bits
{
    unsigned int reserved_0:27;             /**< \brief \internal Reserved */
    unsigned int ADDRESS_27:2;              /**< \brief [28:27] Debug Address Boundary (rw) */
    unsigned int reserved_29:3;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER1_DBMADD_Bits;

/** \\brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER2_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:18;              /**< \brief [19:2] Debug Address Boundary (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER2_DBADD_Bits;

/** \\brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER2_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:18;              /**< \brief [19:2] Debug Address Boundary (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER2_DBMADD_Bits;

/** \\brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER3_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:19;              /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int reserved_21:11;            /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER3_DBADD_Bits;

/** \\brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER3_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:19;              /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int reserved_21:11;            /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER3_DBMADD_Bits;

/** \\brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER4_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:18;              /**< \brief [19:2] Debug Address Boundary (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER4_DBADD_Bits;

/** \\brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER4_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:18;              /**< \brief [19:2] Debug Address Boundary (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER4_DBMADD_Bits;

/** \\brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER5_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:25;              /**< \brief [26:2] Debug Address Boundary (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER5_DBADD_Bits;

/** \\brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER5_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:25;              /**< \brief [26:2] Debug Address Boundary (rw) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER5_DBMADD_Bits;

/** \\brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER6_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:29;              /**< \brief [30:2] Debug Address Boundary (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER6_DBADD_Bits;

/** \\brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER6_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:29;              /**< \brief [30:2] Debug Address Boundary (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER6_DBMADD_Bits;

/** \\brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER7_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:25;              /**< \brief [26:2] Debug Address Boundary (rw) */
    unsigned int reserved_27:1;             /**< \brief \internal Reserved */
    unsigned int ADDRESS_28:3;              /**< \brief [30:28] Debug Address Boundary (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER7_DBADD_Bits;

/** \\brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER7_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:25;              /**< \brief [26:2] Debug Address Boundary (rw) */
    unsigned int reserved_27:1;             /**< \brief \internal Reserved */
    unsigned int ADDRESS_28:3;              /**< \brief [30:28] Debug Address Boundary (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER7_DBMADD_Bits;

/** \\brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER8_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:19;              /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int reserved_21:8;             /**< \brief \internal Reserved */
    unsigned int ADDRESS_29:1;              /**< \brief [29:29] Debug Address Boundary (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER8_DBADD_Bits;

/** \\brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER8_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:19;              /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int reserved_21:8;             /**< \brief \internal Reserved */
    unsigned int ADDRESS_29:1;              /**< \brief [29:29] Debug Address Boundary (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER8_DBMADD_Bits;

/** \\brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER9_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:19;              /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int reserved_21:8;             /**< \brief \internal Reserved */
    unsigned int ADDRESS_29:1;              /**< \brief [29:29] Debug Address Boundary (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER9_DBADD_Bits;

/** \\brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER9_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:19;              /**< \brief [20:2] Debug Address Boundary (rw) */
    unsigned int reserved_21:8;             /**< \brief \internal Reserved */
    unsigned int ADDRESS_29:1;              /**< \brief [29:29] Debug Address Boundary (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER9_DBMADD_Bits;

/** \\brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITERD_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS_2:30;              /**< \brief [31:2] Debug Address Boundary (rw) */
} Ifx_XBAR_ARBITERD_DBADD_Bits;

/** \\brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITERD_DBMADD_Bits
{
    unsigned int ADDRESS_0:32;              /**< \brief [31:0] Debug Address Boundary (rw) */
} Ifx_XBAR_ARBITERD_DBMADD_Bits;

/** \\brief  Debug Control Register */
typedef struct _Ifx_XBAR_DBCON_Bits
{
    unsigned int DBEN:1;                    /**< \brief [0:0] Status of OCDS Enable Signal (r) */
    unsigned int DBSAT:1;                   /**< \brief [1:1] Debug OCDS Trigger Status (rh) */
    unsigned int REARM:1;                   /**< \brief [2:2] Rearm Debug OCDS Trigger (w) */
    unsigned int SETDBEVT:1;                /**< \brief [3:3] Set Debug Event (w) */
    unsigned int reserved_4:12;             /**< \brief \internal Reserved */
    unsigned int RDEN:1;                    /**< \brief [16:16] Read Trigger Enable (rw) */
    unsigned int WREN:1;                    /**< \brief [17:17] Write Trigger Enable (rw) */
    unsigned int SVMEN:1;                   /**< \brief [18:18] SVM Trigger Enable (rw) */
    unsigned int ADDEN:1;                   /**< \brief [19:19] Address Trigger Enable (rw) */
    unsigned int ERREN:1;                   /**< \brief [20:20] Error Trigger Enable (rw) */
    unsigned int reserved_21:2;             /**< \brief \internal Reserved */
    unsigned int MASEN:1;                   /**< \brief [23:23] Master Trigger Enable (rw) */
    unsigned int MASTER:6;                  /**< \brief [29:24] Master TAG ID Trigger Selector (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_DBCON_Bits;

/** \\brief  Debug Trigger Event Status Register */
typedef struct _Ifx_XBAR_DBSAT_Bits
{
    unsigned int SCI0:1;                    /**< \brief [0:0] SCI Debug Trigger Event Status (rwh) */
    unsigned int SCI1:1;                    /**< \brief [1:1] SCI Debug Trigger Event Status (rwh) */
    unsigned int SCI2:1;                    /**< \brief [2:2] SCI Debug Trigger Event Status (rwh) */
    unsigned int SCI3:1;                    /**< \brief [3:3] SCI Debug Trigger Event Status (rwh) */
    unsigned int SCI4:1;                    /**< \brief [4:4] SCI Debug Trigger Event Status (rwh) */
    unsigned int SCI5:1;                    /**< \brief [5:5] SCI Debug Trigger Event Status (rwh) */
    unsigned int SCI6:1;                    /**< \brief [6:6] SCI Debug Trigger Event Status (rwh) */
    unsigned int SCI7:1;                    /**< \brief [7:7] SCI Debug Trigger Event Status (rwh) */
    unsigned int SCI8:1;                    /**< \brief [8:8] SCI Debug Trigger Event Status (rwh) */
    unsigned int SCI9:1;                    /**< \brief [9:9] SCI Debug Trigger Event Status (rwh) */
    unsigned int reserved_10:5;             /**< \brief \internal Reserved */
    unsigned int SCID:1;                    /**< \brief [15:15] Default Slave Debug Trigger Event Status (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_XBAR_DBSAT_Bits;

/** \\brief  Error/Debug Capture Register */
typedef struct _Ifx_XBAR_ERR_Bits
{
    unsigned int RD:1;                      /**< \brief [0:0] Read Indication Status (rh) */
    unsigned int WR:1;                      /**< \brief [1:1] Write Indication Status (rh) */
    unsigned int SVM:1;                     /**< \brief [2:2] Supervisor Mode Indication Status (rh) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int OPC:4;                     /**< \brief [7:4] Operation Code (rh) */
    unsigned int TR_ID:8;                   /**< \brief [15:8] Transaction ID (rh) */
    unsigned int ADDR_ECC:8;                /**< \brief [23:16] SRI Address Phase Error Detection Information (rh) */
    unsigned int MCI_SBS:8;                 /**< \brief [31:24] MCI Sideband Signals [7:0] (rh) */
} Ifx_XBAR_ERR_Bits;

/** \\brief  Error/Debug Address Capture Register */
typedef struct _Ifx_XBAR_ERRADDR_Bits
{
    unsigned int ADDR:32;                   /**< \brief [31:0] Transaction Address (rh) */
} Ifx_XBAR_ERRADDR_Bits;

/** \\brief  External Control Register 5 */
typedef struct _Ifx_XBAR_EXTCON5_Bits
{
    unsigned int reserved_0:3;              /**< \brief \internal Reserved */
    unsigned int WFWD:1;                    /**< \brief [3:3] Wait for FPI Write Data (rw) */
    unsigned int FREQDISS:1;                /**< \brief [4:4] Disable Fast Request Feature for SRI to FPI Transactions (rw) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int FREQDISF:1;                /**< \brief [6:6] Disable Fast Request Feature for FPI to SRI Transactions (rw) */
    unsigned int reserved_7:2;              /**< \brief \internal Reserved */
    unsigned int NODELTR:1;                 /**< \brief [9:9] Control Signal for deferred transactions (rw) */
    unsigned int NORMW:1;                   /**< \brief [10:10] Control Signal for deferred transactions (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int MAX_WS:4;                  /**< \brief [15:12] FPI-Bus Wait State Retry Ratio (rw) */
    unsigned int reserved_16:4;             /**< \brief \internal Reserved */
    unsigned int RETRY_CNT:4;               /**< \brief [23:20] MIF_FPI Retry Idle Count (rw) */
    unsigned int NOPDIS:1;                  /**< \brief [24:24] NOP-Inclusion Disable (rw) */
    unsigned int reserved_25:7;             /**< \brief \internal Reserved */
} Ifx_XBAR_EXTCON5_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_XBAR_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_XBAR_ID_Bits;

