HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxXbar_regdef.h
/** \\brief  Transaction ID Interrupt Enable Register */
typedef struct _Ifx_XBAR_IDINTEN_Bits
{
    unsigned int ENSCI0:1;                  /**< \brief [0:0] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI1:1;                  /**< \brief [1:1] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI2:1;                  /**< \brief [2:2] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI3:1;                  /**< \brief [3:3] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI4:1;                  /**< \brief [4:4] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI5:1;                  /**< \brief [5:5] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI6:1;                  /**< \brief [6:6] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI7:1;                  /**< \brief [7:7] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI8:1;                  /**< \brief [8:8] Enable ID Error from SCIn (rw) */
    unsigned int ENSCI9:1;                  /**< \brief [9:9] Enable ID Error from SCIn (rw) */
    unsigned int reserved_10:5;             /**< \brief \internal Reserved */
    unsigned int ENSCID:1;                  /**< \brief [15:15] Enable ID Error from Default Slave (rw) */
    unsigned int ENMCI0:1;                  /**< \brief [16:16] Enable ID Error from MCI0 (rw) */
    unsigned int reserved_17:2;             /**< \brief \internal Reserved */
    unsigned int ENMCI3:1;                  /**< \brief [19:19] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI4:1;                  /**< \brief [20:20] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI5:1;                  /**< \brief [21:21] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI6:1;                  /**< \brief [22:22] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI7:1;                  /**< \brief [23:23] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI8:1;                  /**< \brief [24:24] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI9:1;                  /**< \brief [25:25] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI10:1;                 /**< \brief [26:26] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI11:1;                 /**< \brief [27:27] Enable ID Error from MCIn (rw) */
    unsigned int ENMCI12:1;                 /**< \brief [28:28] Enable ID Error from MCIn (rw) */
    unsigned int reserved_29:3;             /**< \brief \internal Reserved */
} Ifx_XBAR_IDINTEN_Bits;

/** \\brief  Transaction ID Interrupt Status Register */
typedef struct _Ifx_XBAR_IDINTSAT_Bits
{
    unsigned int IDSCI0:1;                  /**< \brief [0:0] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI1:1;                  /**< \brief [1:1] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI2:1;                  /**< \brief [2:2] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI3:1;                  /**< \brief [3:3] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI4:1;                  /**< \brief [4:4] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI5:1;                  /**< \brief [5:5] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI6:1;                  /**< \brief [6:6] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI7:1;                  /**< \brief [7:7] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI8:1;                  /**< \brief [8:8] Transaction ID Error from SCIn Status (rwh) */
    unsigned int IDSCI9:1;                  /**< \brief [9:9] Transaction ID Error from SCIn Status (rwh) */
    unsigned int reserved_10:5;             /**< \brief \internal Reserved */
    unsigned int IDSCID:1;                  /**< \brief [15:15] Transaction ID Error from Default Slave Status (rwh) */
    unsigned int IDMCI0:1;                  /**< \brief [16:16] Transaction ID Error from MCI0 Status (rwh) */
    unsigned int reserved_17:2;             /**< \brief \internal Reserved */
    unsigned int IDMCI3:1;                  /**< \brief [19:19] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI4:1;                  /**< \brief [20:20] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI5:1;                  /**< \brief [21:21] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI6:1;                  /**< \brief [22:22] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI7:1;                  /**< \brief [23:23] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI8:1;                  /**< \brief [24:24] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI9:1;                  /**< \brief [25:25] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI10:1;                 /**< \brief [26:26] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI11:1;                 /**< \brief [27:27] Transaction ID Error from MCIn Status (rwh) */
    unsigned int IDMCI12:1;                 /**< \brief [28:28] Transaction ID Error from MCIn Status (rwh) */
    unsigned int reserved_29:3;             /**< \brief \internal Reserved */
} Ifx_XBAR_IDINTSAT_Bits;

/** \\brief  Arbiter Interrupt Status Register */
typedef struct _Ifx_XBAR_INTSAT_Bits
{
    unsigned int SCSCI0:1;                  /**< \brief [0:0] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI1:1;                  /**< \brief [1:1] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI2:1;                  /**< \brief [2:2] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI3:1;                  /**< \brief [3:3] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI4:1;                  /**< \brief [4:4] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI5:1;                  /**< \brief [5:5] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI6:1;                  /**< \brief [6:6] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI7:1;                  /**< \brief [7:7] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI8:1;                  /**< \brief [8:8] Starvation Error from SCIn Status (rwh) */
    unsigned int SCSCI9:1;                  /**< \brief [9:9] Starvation Error from SCIn Status (rwh) */
    unsigned int reserved_10:5;             /**< \brief \internal Reserved */
    unsigned int SCSCID:1;                  /**< \brief [15:15] Starvation Error from Default Slave Status (rwh) */
    unsigned int PRSCI0:1;                  /**< \brief [16:16] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI1:1;                  /**< \brief [17:17] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI2:1;                  /**< \brief [18:18] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI3:1;                  /**< \brief [19:19] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI4:1;                  /**< \brief [20:20] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI5:1;                  /**< \brief [21:21] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI6:1;                  /**< \brief [22:22] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI7:1;                  /**< \brief [23:23] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI8:1;                  /**< \brief [24:24] Protocol Error from SCIn Status (rwh) */
    unsigned int PRSCI9:1;                  /**< \brief [25:25] Protocol Error from SCIn Status (rwh) */
    unsigned int reserved_26:5;             /**< \brief \internal Reserved */
    unsigned int PRSCID:1;                  /**< \brief [31:31] Protocol Error from Default Slave Status (rwh) */
} Ifx_XBAR_INTSAT_Bits;

/** \\brief  Arbiter Priority Register */
typedef struct _Ifx_XBAR_PRIOH_Bits
{
    unsigned int MASTER8:4;                 /**< \brief [3:0] Master 8 Priority (rw) */
    unsigned int MASTER9:4;                 /**< \brief [7:4] Master 9 Priority (rw) */
    unsigned int MASTER10:4;                /**< \brief [11:8] Master 10 Priority (rw) */
    unsigned int MASTER11:4;                /**< \brief [15:12] Master 11 Priority (rw) */
    unsigned int MASTER12:4;                /**< \brief [19:16] Master 12 Priority (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_XBAR_PRIOH_Bits;

/** \\brief  Arbiter Priority Register */
typedef struct _Ifx_XBAR_PRIOL_Bits
{
    unsigned int MASTER0:4;                 /**< \brief [3:0] Master 0 Priority (rw) */
    unsigned int reserved_4:8;              /**< \brief \internal Reserved */
    unsigned int MASTER3:4;                 /**< \brief [15:12] Master 3 Priority (rw) */
    unsigned int MASTER4:4;                 /**< \brief [19:16] Master 4 Priority (rw) */
    unsigned int MASTER5:4;                 /**< \brief [23:20] Master 5 Priority (rw) */
    unsigned int MASTER6:4;                 /**< \brief [27:24] Master 6 Priority (rw) */
    unsigned int MASTER7:4;                 /**< \brief [31:28] Master 7 Priority (rw) */
} Ifx_XBAR_PRIOL_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Xbar_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ACCEN0_Bits B;
} Ifx_XBAR_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ACCEN1_Bits B;
} Ifx_XBAR_ACCEN1;

/** \\brief  Arbiter Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBCON_Bits B;
} Ifx_XBAR_ARBCON;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER0_DBADD_Bits B;
} Ifx_XBAR_ARBITER0_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER0_DBMADD_Bits B;
} Ifx_XBAR_ARBITER0_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER1_DBADD_Bits B;
} Ifx_XBAR_ARBITER1_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER1_DBMADD_Bits B;
} Ifx_XBAR_ARBITER1_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER2_DBADD_Bits B;
} Ifx_XBAR_ARBITER2_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER2_DBMADD_Bits B;
} Ifx_XBAR_ARBITER2_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER3_DBADD_Bits B;
} Ifx_XBAR_ARBITER3_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER3_DBMADD_Bits B;
} Ifx_XBAR_ARBITER3_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER4_DBADD_Bits B;
} Ifx_XBAR_ARBITER4_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER4_DBMADD_Bits B;
} Ifx_XBAR_ARBITER4_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER5_DBADD_Bits B;
} Ifx_XBAR_ARBITER5_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER5_DBMADD_Bits B;
} Ifx_XBAR_ARBITER5_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER6_DBADD_Bits B;
} Ifx_XBAR_ARBITER6_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER6_DBMADD_Bits B;
} Ifx_XBAR_ARBITER6_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER7_DBADD_Bits B;
} Ifx_XBAR_ARBITER7_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER7_DBMADD_Bits B;
} Ifx_XBAR_ARBITER7_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER8_DBADD_Bits B;
} Ifx_XBAR_ARBITER8_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER8_DBMADD_Bits B;
} Ifx_XBAR_ARBITER8_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER9_DBADD_Bits B;
} Ifx_XBAR_ARBITER9_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITER9_DBMADD_Bits B;
} Ifx_XBAR_ARBITER9_DBMADD;

/** \\brief  Debug Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITERD_DBADD_Bits B;
} Ifx_XBAR_ARBITERD_DBADD;

/** \\brief  Debug Mask Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ARBITERD_DBMADD_Bits B;
} Ifx_XBAR_ARBITERD_DBMADD;

/** \\brief  Debug Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_DBCON_Bits B;
} Ifx_XBAR_DBCON;

/** \\brief  Debug Trigger Event Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_DBSAT_Bits B;
} Ifx_XBAR_DBSAT;

/** \\brief  Error/Debug Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ERR_Bits B;
} Ifx_XBAR_ERR;

/** \\brief  Error/Debug Address Capture Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ERRADDR_Bits B;
} Ifx_XBAR_ERRADDR;

/** \\brief  External Control Register 5 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_EXTCON5_Bits B;
} Ifx_XBAR_EXTCON5;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_XBAR_ID_Bits B;
} Ifx_XBAR_ID;

