HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxXbar_regdef.h
/** \\brief  XBAR object */
typedef volatile struct _Ifx_XBAR
{
    unsigned char reserved_0[4];            /**< \brief 0, \internal Reserved */
    Ifx_XBAR_ARBITERD ARBITERD;             /**< \brief 4, Arbiter objects */
    unsigned char reserved_24[32];          /**< \brief 24, \internal Reserved */
    Ifx_XBAR_ARBITER0 ARBITER0;             /**< \brief 44, Arbiter objects */
    unsigned char reserved_64[32];          /**< \brief 64, \internal Reserved */
    Ifx_XBAR_ARBITER1 ARBITER1;             /**< \brief 84, Arbiter objects */
    unsigned char reserved_A4[32];          /**< \brief A4, \internal Reserved */
    Ifx_XBAR_ARBITER2 ARBITER2;             /**< \brief C4, Arbiter objects */
    unsigned char reserved_E4[32];          /**< \brief E4, \internal Reserved */
    Ifx_XBAR_ARBITER3 ARBITER3;             /**< \brief 104, Arbiter objects */
    unsigned char reserved_124[32];         /**< \brief 124, \internal Reserved */
    Ifx_XBAR_ARBITER4 ARBITER4;             /**< \brief 144, Arbiter objects */
    unsigned char reserved_164[28];         /**< \brief 164, \internal Reserved */
    Ifx_XBAR_EXTCON5 EXTCON5;               /**< \brief 180, External Control Register 5 */
    Ifx_XBAR_ARBITER5 ARBITER5;             /**< \brief 184, Arbiter objects */
    unsigned char reserved_1A4[32];         /**< \brief 1A4, \internal Reserved */
    Ifx_XBAR_ARBITER6 ARBITER6;             /**< \brief 1C4, Arbiter objects */
    unsigned char reserved_1E4[32];         /**< \brief 1E4, \internal Reserved */
    Ifx_XBAR_ARBITER7 ARBITER7;             /**< \brief 204, Arbiter objects */
    unsigned char reserved_224[32];         /**< \brief 224, \internal Reserved */
    Ifx_XBAR_ARBITER8 ARBITER8;             /**< \brief 244, Arbiter objects */
    unsigned char reserved_264[32];         /**< \brief 264, \internal Reserved */
    Ifx_XBAR_ARBITER9 ARBITER9;             /**< \brief 284, Arbiter objects */
    unsigned char reserved_2A4[356];        /**< \brief 2A4, \internal Reserved */
    Ifx_XBAR_ID ID;                         /**< \brief 408, Module Identification Register */
    Ifx_XBAR_DBSAT DBSAT;                   /**< \brief 40C, Debug Trigger Event Status Register */
    Ifx_XBAR_INTSAT INTSAT;                 /**< \brief 410, Arbiter Interrupt Status Register */
    Ifx_XBAR_IDINTSAT IDINTSAT;             /**< \brief 414, Transaction ID Interrupt Status Register */
    Ifx_XBAR_IDINTEN IDINTEN;               /**< \brief 418, Transaction ID Interrupt Enable Register */
    unsigned char reserved_41C[220];        /**< \brief 41C, \internal Reserved */
    Ifx_XBAR_ACCEN1 ACCEN1;                 /**< \brief 4F8, Access Enable Register 1 */
    Ifx_XBAR_ACCEN0 ACCEN0;                 /**< \brief 4FC, Access Enable Register 0 */
} Ifx_XBAR;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXXBAR_REGDEF_H */
